---
kind: method
id: M:Autodesk.Revit.DB.InstanceBinding.#ctor(Autodesk.Revit.DB.CategorySet)
source: html/b090b5a8-9229-7079-9f8f-6e7518d9b708.htm
---
# Autodesk.Revit.DB.InstanceBinding.#ctor Method

Constructs an instance binding with the set of categories passed.

## Syntax (C#)
```csharp
public InstanceBinding(
	CategorySet categories
)
```

## Parameters
- **categories** (`Autodesk.Revit.DB.CategorySet`)

## Remarks
Categories can be set or changed at a later time by using the Categories property of this object.